# WhileLoadingFamilyShared Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..WhileLoadingFamilyShared Property
BuiltInFailures..::..FamilyFailures Class See Also
---
While loading shared family '[Family Name]' from family '[Family Name]': [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WhileLoadingFamilyShared { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WhileLoadingFamilyShared As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WhileLoadingFamilyShared {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace